* Additional usage

#+begin_src sh :results output verbatim :exports both
./pj_compensate --help
#+end_src

#+RESULTS:
#+begin_example
Usage: pj_compensate [OPTION...] ORIGINAL-TRACE COPYTIME-DATA OVERHEAD-DATA
Outputs a trace compensating for Aky's intrusion

  -e, --estimator=ESTIMATOR  Either 'mean' (default) or 'histogram'
  -t, --trimming=FACTOR      Trim outliers by FACTOR (default 0.1, i.e. 10%)
  -y, --sync=BYTES           Sends are synchronous with msg sizes >= this.
                             Default 4025, OMPI 1.6.5 SM BTL default eager
                             limit minus header size
  -?, --help                 Give this help list
      --usage                Give a short usage message
  -v, --version              Print version

Mandatory or optional arguments to long options are also mandatory or optional
for any corresponding short options.
#+end_example
** What does each file do?

#+begin_src sh :results output verbatim
find -name '*.h' | xargs head -n 1
#+end_src

#+RESULTS:
#+begin_example
==> ./include/compensation.h <==
/* Routines to compensate event timestamps */

==> ./include/args.h <==
/* Argument parsing */

==> ./include/prng.h <==
/* pseudo ranodm double between 0 and 1, uniformally distributed */

==> ./include/hist.h <==
/* Formulas for histograms */

==> ./include/ref.h <==
/* Simple reference counting data structure for embedding, for internal use. */

==> ./include/queue.h <==
/* State and link queue implementations (see also events.h) */

==> ./include/reader.h <==
/* Routines to read binaries generated by Aky and structs to store the data */

==> ./include/events.h <==
/* Ref counted event structs (States and Links) and associated routines */

==> ./include/logging.h <==
/* A simple logging macro and some wrappers */

==> ./include/utlist.h <==
/* The famous utlist macro lib */
#+end_example

#+begin_src sh :results output verbatim
find -name '*.c' | xargs head -n 1
#+end_src

#+RESULTS:
#+begin_example
==> ./src/hist.c <==
/* See the header file for contracts and more docs */

==> ./src/pj_compensate.c <==
/* Main application */

==> ./src/events.c <==
/* See the header file for contracts and more docs */

==> ./src/compensation.c <==
/* See the header file for contracts and more docs */

==> ./src/reader.c <==
/* See the header file for contracts and more docs */

==> ./src/pj_dump_parse.c <==
/* Read a pj_dump trace file into the event queues */

==> ./src/queue.c <==
/* See the header file for contracts and more docs */
#+end_example

